orientation/orientation_2022_09_18_slides.html
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"><title></title><meta name="author" content=""><meta name="description" content=""><meta name="keywords" content=""><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/blood.css" id="theme"><!-- If the query includes 'print-pdf', include the PDF print sheet --><link rel="stylesheet" type="text/css" href="https://buildhello.ca/orientation/blood.css"></head><body><div class="reveal"><div class="slides"><section id="sec-title-slide"><h3 style="color:blue;">Build Hello Orientation 1 - 2022-09-18</h3></section><section><section id="slide-orge1a9db8"><h2 id="orge1a9db8">1. Run a memory test on Taro</h2><div class="outline-text-2" id="text-orge1a9db8"></div></section><section id="slide-org5a2d3a0"><h3 id="org5a2d3a0">^</h3><ul><li>Score was 73 turns to clear the board, just a little more accuracy than the average of people I’ve tested (but my sample set is not an average of society)</li><li>Taro was slower than everybody I’ve tested</li><li>There is no indication that going slower is less effective in the long-run, in fact chess players take as much time as possible</li></ul></section><section id="slide-orgd1b2c57"><h3 id="orgd1b2c57">^</h3><ul><li>However, in programming there are deadlines, programmers follow software production methodologies called ’Agile’</li><li>Agile says do it in teams to make the release date, then iterate through to get feedback from users and make it again with an update or new release</li><li>The main reason is if you take a lot of time to build something really well, then find people don’t use it the way you designed it, you will die a slow death (or fast)</li></ul></section><section id="slide-org94cbc3b"><h3 id="org94cbc3b">^</h3><ul><li>So you need to be comfortable making mistakes</li><li>Facebook says, “Move fast and break things!”</li></ul></section></section><section><section id="slide-orgc74105d"><h2 id="orgc74105d">2. Introduce simultaneous typing and speaking exercise</h2><div class="outline-text-2" id="text-orgc74105d"></div></section><section id="slide-org06c76dd"><h3 id="org06c76dd">^</h3><ul><li>while typing into a computerized typing lesson program (in the browser) listen to a speaker speak with media player or vlc and repeat what they say</li><li>This teaches the brain to multi-task, it also ensures you are typing with the least amount of brain power, which forces you to learn more quickly</li><li>It also builds your listening skills, your vocal chords, and your English skills</li></ul></section><section id="slide-orgc7a53e6"><h3 id="orgc7a53e6">^</h3><ul><li>And it makes your brain more precise</li><li>The ultimate exercise, is to give a lecture while doing exercise, because then your brain is remembering, arranging context (thinking of what to say), and saying it, while you are reading and typing simultaneously [that is a very difficult exercise]</li></ul></section><section id="slide-orge4f5354"><h3 id="orge4f5354">^</h3><p><a href="https://www.speedtypingonline.com/typing-test">https://www.speedtypingonline.com/typing-test</a></p></section></section><section><section id="slide-org188ae87"><h2 id="org188ae87">3. Install Chocolately</h2><div class="outline-text-2" id="text-org188ae87"></div></section><section id="slide-org1a8b5d9"><h3 id="org1a8b5d9">Chocolately installation powershell</h3><ul><li>open powershell with right click administrator privileges</li><li>navigate to <a href="https://chocolatey.org/install">https://chocolatey.org/install</a></li><li>read website instructions</li></ul></section><section id="slide-org23f9808"><h3 id="org23f9808">^</h3><ul><li>set execution policy</li></ul></section><section id="slide-org423e234"><h3 id="org423e234">^</h3><div class="org-src-container"><pre class="src src-powershell"><code trim>Set-ExecutionPolicy Bypass -Scope Process -Force; [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.ServicePointManager]::SecurityProtocol -bor 3072; iex ((New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1'))
</code></pre></div></section><section id="slide-org0dff903"><h3 id="org0dff903">^</h3><ul><li>downloads and installs Chocolately with a script</li></ul></section><section id="slide-org9654b2a"><h3 id="org9654b2a">Chocolately Graphical User Interface [GUI]</h3><ul><li>after setting execution policy above [if not set]</li><li>open powershell in administration mode and run</li><li>choco install ChocolateyGUI</li></ul></section></section><section><section id="slide-org7c5243d"><h2 id="org7c5243d">4. Why use Chocolately</h2><div class="outline-text-2" id="text-org7c5243d"></div></section><section id="slide-org1178fa3"><h3 id="org1178fa3">^</h3><ol><li>can export programs installed, and you should be able to import them to install on a new installation</li><li>Chocolately adds programs automatically to your windows path, which allows other programs to find them and allows you to run them from a command line in any directory</li><li>extends path limit</li></ol></section><section id="slide-orge8c049e"><h3 id="orge8c049e">^</h3><ol><li>can easily update, remove, and view packages installed</li><li>you need to find where Chocolately installs programs on your computer, and note the location in a file</li></ol></section></section><section><section id="slide-org4a75cbc"><h2 id="org4a75cbc">5. Install Brave Browser</h2><div class="outline-text-2" id="text-org4a75cbc"></div></section><section id="slide-org25e9c71"><h3 id="org25e9c71">^</h3><ul><li>Select chocolatey selection to search programs available on chocolaty</li><li>The ’programs on your computer’ selection in chocolaty enables search and managing packages installed on your computer by chocolatey</li><li>Remember, a package is a program.</li></ul></section><section id="slide-org6757440"><h3 id="org6757440">^</h3><ul><li>Search for Brave</li><li>Select install package</li></ul></section><section id="slide-org079a25b"><h3 id="org079a25b">^</h3><ul><li>Brave use less working memory [RAM], and includes functionality you need to install plugins to get on chrome</li></ul></section><section id="slide-org4703f77"><h3 id="org4703f77">^</h3><ul><li>Remember brave uses the ’Chromium’ engine, which is the foundation of Chrome that Google made open source</li><li>(Many other browser use Chromium as well)</li></ul></section></section><section><section id="slide-org556d410"><h2 id="org556d410">6. Discuss some differences between Linux and Windows</h2><div class="outline-text-2" id="text-org556d410"></div></section><section id="slide-orgfcea68a"><h3 id="orgfcea68a">Linux Programs</h3><ul><li>Programs installed on Linux install only the libraries that don’t already exist on Linux</li><li>Libraries that are installed, go into directories in the Linux file architecture, where they can be shared</li><li>The programmer who creates the program, chooses where the files will be installed</li></ul></section><section id="slide-orgea2f697"><h3 id="orgea2f697">^</h3><ul><li>We can talk about Linux architecture later</li></ul></section><section id="slide-org139c49e"><h3 id="org139c49e">Windows Programs</h3></section><section id="slide-org405a35c"><h3 id="org405a35c">^</h3><ul><li>Install the entire program and its dependencies in one or more ’program specific directories’</li></ul></section></section><section><section id="slide-org8ddc166"><h2 id="org8ddc166">7. What is program or package?</h2><div class="outline-text-2" id="text-org8ddc166"></div></section><section id="slide-org881df6b"><h3 id="org881df6b">^</h3><ul><li>Imagine cards from a deck of cards unarranged</li><li>Let each card represent a library of code, which is code that works together to achieve a specific purpose in a specific language</li><li>Now imagine many cards (libraries) arranged in a vertical line and stapled together</li></ul></section><section id="slide-orgddf5101"><h3 id="orgddf5101">^</h3><ul><li>This is a program (on windows an .exe file)</li><li>Only a windows program will have dependencies, which are programs libraries need to function, included in the .exe</li></ul></section><section id="slide-orga733e25"><h3 id="orga733e25">^</h3><ul><li>We can envision dependencies, as cards (libraries) arranged perpendicular to the vertical line of cards we stapled together</li><li>On Linux (or Unix based computer systems), dependencies need to be installed</li></ul></section></section><section><section id="slide-org5d5c2ec"><h2 id="org5d5c2ec">8. What is Bash?</h2><div class="outline-text-2" id="text-org5d5c2ec"></div></section><section id="slide-org66b8f5b"><h3 id="org66b8f5b">^</h3><ul><li>Bash is a shell scripting language used to operate the ’bash’ shell, which is unix/Linux shell</li></ul></section></section><section><section id="slide-orgae7e21e"><h2 id="orgae7e21e">9. What is the difference between WSL, Linux, Cygwin, and MSYS2?</h2><div class="outline-text-2" id="text-orgae7e21e"></div></section><section id="slide-org34bc598"><h3 id="org34bc598">operating systems and hardware</h3><ul><li>On a windows computer the operating system uses machine code to run the computer hardware</li><li>There’s a lot of functionality the operating system brings to the computer, including ’threading,’ ’multitasking,’ ’memory management’ and more, but we won’t talk about that here</li></ul></section><section id="slide-org2c8038b"><h3 id="org2c8038b">shells</h3><ul><li>The shell is an installed or included program that enables communication between the operating system and the programs on the computer, as well as even the hardware.</li><li>[though it is not the same as the ’bios’, which is a program that is specific to the hardware]</li></ul></section><section id="slide-orgce01a35"><h4 id="orgce01a35">^</h4><ul><li>Every shell has programs it can use</li><li>Windows Shells, CMD, and Powershell are not the same as Unix shells, like Bash, ZSH, oh-my-zsh, and many more</li></ul></section><section id="slide-org9ee67a0"><h3 id="org9ee67a0">WSL</h3><ul><li>WSL is a subsystem, a containerized unix virtual machine that takes ’Linux’ operating systems</li><li>WSL allows the Windows system to run one or more Linux systems, which have lower level communication with the hardware [the operating systems can communicate with each other, without using a server]</li></ul></section><section id="slide-org0c5bf8b"><h4 id="org0c5bf8b">^</h4><ul><li>WSL is the closest you can get on Windows to have a pure Linux system, it is sort of like running a Linux system in a docker container</li></ul></section><section id="slide-orgc2bafee"><h3 id="orgc2bafee">Cygwin</h3><ul><li>Cygwin is the next closest thing to a Linux system on Windows</li><li>It installs as a file directory on your windows system that contains Linux programs designed to work with Windows [I believe without emulating a Linux kernal, but check me on that.]</li><li>It is much more strict in terms of maintaining acting like a Linux system</li></ul></section><section id="slide-org086f9ef"><h3 id="org086f9ef">MSYS2</h3><ul><li>MSYS2 is less strict than Cygwin, in terms of acting like a Linux system, but it operates essentially the same as Cygwin and uses a lot of Cygwin functionality</li><li>There are more programs available for MSYS2 than Cygwin</li></ul></section><section id="slide-orgd4271ca"><h3 id="orgd4271ca">Why do want to use WSL, Cygwin, or MSYS2 on WIndows?</h3><ul><li>There are programs for Linux that are unique, and sometimes we want to use them</li><li>For example, the build chain programs and compilers like GCC enable programmers to ’make’ software on windows [turn selected libraries and dependencies into windows executable ]</li></ul></section><section id="slide-org761012f"><h4 id="org761012f">^</h4><ul><li>This is done often for programs that aren’t made for Windows</li><li>Actually, the Chocolately package manager has a lot of Linux programs made just for windows</li></ul></section></section><section><section id="slide-org286dc64"><h2 id="org286dc64">10. Why did we want to build Emacs 29 on Windows</h2><div class="outline-text-2" id="text-org286dc64"></div></section><section id="slide-org7ce867b"><h3 id="org7ce867b">^</h3><ul><li>This is the best way to do it</li><li>You can specify the number of cores, which allows emacs to run operations in parallel across the cores of your computer</li></ul></section><section id="slide-orgd0462b3"><h3 id="orgd0462b3">^</h3><ul><li>Any emacs libraries or subsystem libraries (cygwin, wsl, msys2) made especially for your computer architecture can also be installed</li><li>In emacs, you can choose as a build option, ’native-compilation’ which compresses your entire emacs installation into machine code</li></ul></section><section id="slide-org5366765"><h3 id="org5366765">^</h3><ul><li>That means your computer can read the files without needing your operating system to translate, that’s faster</li><li>Emacs will also compile your files into machine code files when you install them, including the packages you install to emacs</li></ul></section></section><section><section id="slide-org9bde799"><h2 id="org9bde799">11. How did we attempt to build emacs on windows</h2><div class="outline-text-2" id="text-org9bde799"></div></section><section id="slide-org49ba5e1"><h3 id="org49ba5e1">1. We installed MSYS2 onto windows using Chocolatey</h3><ul><li>actually we installed into c:/tools/</li><li>then we followed the directions I wrote on the blog post on my magazine, www.readingworldmagazine.com</li></ul></section><section id="slide-orgaba681b"><h4 id="orgaba681b">^</h4><p><a href="https://readingworldmagazine.com/emacs/2022-02-24-compiling-emacs-29-from-source-on-windows/">https://readingworldmagazine.com/emacs/2022-02-24-compiling-emacs-29-from-source-on-windows/</a></p></section><section id="slide-orgfa4ae1c"><h4 id="orgfa4ae1c">^</h4><ul><li>these directions worked exactly as is for a machine I worked on</li><li>however, when I followed the same directions on another machine I work on, I needed to find and install some other libraries</li></ul></section><section id="slide-org137b813"><h4 id="org137b813">^</h4><ul><li>We tried to build emacs this way on Taro’s computer, but we were missing a library, some settings, or some specific programs we need in the MSYS2 system</li><li>So we couldn’t install</li></ul></section></section><section><section id="slide-orgdac97f8"><h2 id="orgdac97f8">12. We installed emacs</h2><div class="outline-text-2" id="text-orgdac97f8"></div></section><section id="slide-org6b5b0fa"><h3 id="org6b5b0fa">^</h3><ul><li>We installed a version of emacs (28) on Taro’s computer, using Chocolately</li><li>It’s not running super fast functionality, but it should do</li></ul></section></section><section><section id="slide-orgace6622"><h2 id="orgace6622">13. View the history of emacs</h2><div class="outline-text-2" id="text-orgace6622"></div></section><section id="slide-org09daf9e"><h3 id="org09daf9e">^</h3><ul><li>you can watch the video on my magazine, it’s pretty cool</li></ul><p><a href="https://readingworldmagazine.com/emacs/2021-11-30-emacs-conference-comments/">https://readingworldmagazine.com/emacs/2021-11-30-emacs-conference-comments/</a></p></section></section><section><section id="slide-orgb27d181"><h2 id="orgb27d181">14. Reprogram the control key on Taro’s computer</h2><div class="outline-text-2" id="text-orgb27d181"></div></section><section id="slide-org6e2fc93"><h3 id="org6e2fc93">^</h3><ul><li>We installed a program called ’sharpkeys’ by randyrants.com</li><li>It allows us to change keys on windows</li><li>We changed the CAPSLOCK KEY for the CONTROL KEY</li></ul></section><section id="slide-orgd73bbf8"><h3 id="orgd73bbf8">^</h3><ul><li>This is the way to use emacs</li></ul></section></section><section><section id="slide-orgd714f4d"><h2 id="orgd714f4d">15. Introduce some movements</h2><div class="outline-text-2" id="text-orgd714f4d"></div></section><section id="slide-org3096035"><h3 id="org3096035">^</h3><p>C-n, next C-p, previous C-b, back</p></section><section id="slide-org12bcffb"><h3 id="org12bcffb">^</h3><p>C-f, forward M-x, run a program that opens the emacs mini-buffer and allows user to select and run interactive emacs functions</p></section></section></div></div><script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script><script>// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]

});</script></body></html>